"""
В бескінечному циклі користувач вводить строки. Відповідь чи є строка паліндромом - дорівнює сама собі задом на перед.
Переривається при вводі пустої строки
""" #Прикольная задачка, но достаточно простая. Интересно на 4-5, сложность на троечку.
while True:
    string = input('Введите строку и я дам вам ответ является ли она палиндромом. Прервать задачу - ничего не пишите.')
    if string == '':
        break
    else:
        pali = True
        for x in range(len(string)):
            if string[x] != string[-x-1]:
                pali = False
        if pali:
            print('PALIPALIPALINDROM')
        else:
            print('Ne palindrom :(')