#task1
"""
seed(19) використовуємо для рандому щоб у всіх було однаково.
Підкидається монетка орел\рішка
Гравець мав депозит очок.
Гравець може зробити ставку на випадок 100 1 - 100 на решку
Додати якусь кількість конкурентів ботів які також можть рботити ставки.
Вигриаєте то сумма банку розподіляжться до цілих між гравцями що вгадали.
100 кидкив монетки.
Записали в файл історію гри

"""
#task 2

"""classmethod для прямокутника з двох точок створеного(діагональ)"""
#task3
"""
зробити метод валідації статік методом
"""