#task1
"""
Написати програму Що складає, віднімає, робить скалярний і векторний додаток над векторами
асерти пишите самі
"""

#task2
"""
Реальзувати метод підрахунку довжин ліній. зробити метод компаре, який буде зрівнювати лінії і казатит яка довша
"""

#task3
"""
В відриві від проекту обміника написати програму через класс, яка складає сумму декількох валют та виводить у іншій.
Для простоти гривня, долар, евро, злотий
"""

class Currency()
    pass

my_saving = Currency(33, 100, 200, 100)# 4 наших валюти
my_saving.summary() - виводить мій банк в різних валютах як є
my_saving.UAH - скільки окрмої валюти
my_saving.eqvival("UAH") - 33, 100, 200, 100 - загалом в гривнях\чи інших з 4
my_saving == your_saving - true якщо сумми в еквіваленті рівні
my_saving + your_saving ....

#task4
"""
typing на клас каренсі та класл Ленс
"""
