#task1
"""розрзаховувалась вагова категорі бійця
додати до рекорду бійця поразку чи перемогу, нічию
написати красивий репр
Збобити десь інтсанців боксерів з випадковими величинами ростру, ваги, рекордів, віку
,nickname - 5 реальних боесерів 5 імен тварин 5 прикметників
"""

class Fighter():

    def __init__(self):
        self.style
        self.record
        self.nickname




class Boxedr(Person, Fighter):
    pass

#tack 2
"""
Написати програму яка будує прямокутник(вершини), коло за заданими точками(центр і точка на колі в вм=ипаду кола), трикутник
кожна фігура має вміти рахувати периметр, площу, та перевірку на правильність введених вершин
"""